---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisResultSchema.#ctor(Autodesk.Revit.DB.Analysis.AnalysisResultSchema)
source: html/3c3c930b-ecd3-62e7-f94e-88e6915edd54.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisResultSchema.#ctor Method

Constructs a new copy of the input AnalysisResultSchema object.

## Syntax (C#)
```csharp
public AnalysisResultSchema(
	AnalysisResultSchema other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.AnalysisResultSchema`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null